 #โปรแกรมคำนวณราคาสินค้าที่รับส่วนลดแล้ว โดยป้อนรหัสสินค้า ชื่อสินค้า ประเภทสินค้า ซึ่งมี 4 ประเภท คือ food(F/f), woman(W/w), man(M/m), kitchen(K/k) 
# โดยป้อนเป็นตัวย่อ  และราคาสินค้าทางแป้นพิมพ์ แล้วคำนวณราคาสินค้าที่รับส่วนลดแล้วทางหน้าจอ โดยสินค้าประเภท food ลด 2% 
# ของราคาสินค้า, woman ลด 4% ของราคาสินค้า, man ลด 6% ของราคาสินค้า, kitchen ลด 10% ของราคาสินค้า 
# หากป้อนประเภทสินค้าผิดจากที่กำหนดให้แสดงข้อความ "คุณป้อนประเภทผิด !!!"
print('-----------------------')
print(' โปรแกรม Product Sale')
print('-----------------------')
pro_id = input ('ป้อนรหัสสินค้า')
pro_name = input ('ป้อนชื่อสินค้า')
pro_typ = input ('ป้อนประเภทสินค้า')
pro_price = float(input ('ป้อนราคาสสินค้า'))
print('-----------------------')