# โปรแกรมตรวจสอบข้อมูลสายรถเมล์ โดยที่
# หากผู้ใช้ป้อนสายรถเมล์ 57 แสดงข้อความ สาย  57 ไปปิ่นเกล้า บางขุนนนท์หากผู้ใช้ป้อนสายรถเมล์ 3 
# แสดงข้อความ สาย  3 ไปสนามหลวงลาดพร้าวหากผู้ใช้ป้อนสายรถเมล์ 71 แสดงข้อความ สาย  71ไปหัวลำโพง 
# เยาวราชหากผู้ใช้ป้อนสายรถเมล์ 56 แสดงข้อความ สาย 56 ไปบางลำพู สะพานกรุงธน
# หากผูใช้ป้อนสายรถเมล์ 539 แสดงข้อความ สาย  539 ไปอนุสวรีย์ชัย สามเสน
# หากผู้ใช้ป้อนสายรถเมล์สายอื่นนอกจากนี้ แสดงข้อความ ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม


# โปรแกรมตรวจสอบข้อมูลสายรถเมล์

def check_bus_route():
  """
  ฟังก์ชันสำหรับตรวจสอบข้อมูลสายรถเมล์ตามที่ผู้ใช้ป้อน
  """
  bus_route = input("กรุณาป้อนหมายเลขสายรถเมล์: ")

  # ใช้โครงสร้าง if-elif-else เพื่อตรวจสอบเงื่อนไขแต่ละสาย
  if bus_route == "57":
    print("สาย 57 ไปปิ่นเกล้า บางขุนนนท์")
  elif bus_route == "3":
    print("สาย 3 ไปสนามหลวง ลาดพร้าว")
  elif bus_route == "71":
    print("สาย 71 ไปหัวลำโพง เยาวราช")
  elif bus_route == "56":
    print("สาย 56 ไปบางลำพู สะพานกรุงธน")
  elif bus_route == "539":
    print("สาย 539 ไปอนุสาวรีย์ชัย สามเสน")
  else:
    print("ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม")
check_bus_route()
print('ขอบคุณค่ะ')

