# โปรแกรมตรวจสอบรถว่าผ่านเกณฑ์ของการตรวจสอบค่าคาร์บอนไดซ์ออกไซน์หรือ
# โดยหากค่าคาร์บอนไดซ์ออกไซน์มีค่าเกินกว่า 678.55 ให้แสดงข้อความว่า “ไม่ผ่าน”  หากน้อยกว่า 678.55 ให้แสดงข้อความ “ผ่าน”  
# โดยให้รับชื่อเจ้าของ ทะเบียนรถ และปริมาณก๊าซคาร์บอนไดซ์ออกไซน์ที่วัดได้ ทางแป้นพิมพ์

print('-----------------------')
print('....ตรวจสอบสภาพรถ.....')
print('-----------------------')
car_ower = input ('ป้อนชื่อเจ้าของรถ: ')
car_number = input ('ป้อนะเบียนรถ: ')
car_carbon = float(input ('ป้อนปริมาณคาร์บอนไดออกไซน์ : '))
print('-----------------------')